{"hash":"de15e817fb86351ef24021da81219c80a1367efd","data":{"markDown":{"id":"4dce42da42a35a90890b0ddb8a821878","title":"Messages","hideTitle":null,"subtitle":"A message is a textual communication that tells the user what's going on within our product.","content":"\r\n## What is a message?\r\n\r\nA message is a communication with the user&mdash;one that's supposed to convey ideas and evoke a positive emotional response. When thinking about messages, it's essential to think about the content of that communication first, before considering the proper way to style it.\r\n\r\nIn other words, messages consist of two components. First, there's the message type, which refers to the kind of content the message needs to convey. Then, there's the delivery system, which refers to the design element used to present that content.\r\n\r\nIn order to build an effective message, think about what the user needs to know, when they need to know it, and what delivery systems are available to convey the message.\r\n\r\n<hr>\r\n\r\n## Delivery systems\r\n\r\nDelivery systems are the vehicles we use to convey a message to the user. Remember, the message type&mdash;the information conveyed, the audience, the context on the page, etc.&mdash;should determine the type of delivery system used, not the other way around.\r\n\r\n<Grid>\r\n<GridCol col=\"span-4\">\r\n\r\n#### Well\r\n\r\nA non-dismissible container with text. For more information, see [Wells](/components/zui-well).\r\n\r\n</GridCol>\r\n<GridCol col=\"span-4\">\r\n\r\n#### Toast\r\n\r\nAn unobtrusive, dismissible piece of text in a window element. For more information, see [Toast](/components/zui-notifier).\r\n\r\n</GridCol>\r\n<GridCol col=\"span-4\">\r\n\r\n#### Dialog\r\n\r\nText displayed in a content box layered above the current page. For more information, see [Dialog](/components/zui-dialog).\r\n\r\n</GridCol>\r\n<GridCol col=\"span-4\">\r\n\r\n#### Tooltip\r\n\r\nA short, helpful piece of text produced by hovering, often an icon next to the field it is referencing. For more information, see [Tooltip](/components/zui-tooltip).\r\n\r\n</GridCol>\r\n<GridCol col=\"span-4\">\r\n\r\n#### Popover\r\n\r\nText displayed in a content box adjacent to the form field or page section it applies to, that opens and closes with a click.\r\n\r\n</GridCol>\r\n\r\n<GridCol col=\"span-4\">\r\n\r\n#### Uncontained text\r\n\r\nAny text without styling around it. Uncontained text is available on screen at all times to give direction and context to the page or section.\r\n\r\n</GridCol>\r\n\r\n</Grid>\r\n\r\n<hr>\r\n\r\n## Message types\r\n\r\nThe message type refers to the specific content the message needs to convey. In addition to the information that the message contains, message type also considers the importance of the message as well as the tone of the message.\r\n\r\n### General instruction\r\n\r\nGeneral instructions are basic page instructions or page section descriptions. General instruction messages provide context, letting the user know where they are or what they can do.\r\n\r\n#### Delivery systems\r\n\r\n[Uncontained text](#uncontained-text)\r\n\r\n### Guidance\r\n\r\nGuidance text offers the user additional information, instruction or context, and usually applies to a specific page element or action. Unlike alerts, guidance precedes the user's action and shouldn't interrupt a workflow. In other words, guidance may be helpful, but shouldn't be <strong>necessary</strong> for a user to complete their desired action.\r\n\r\nThere are three general kinds of guidance messages&mdash;suggestions, information and warnings. The boundaries between these kinds of messages may not always be distinct, and often the same set of facts could be conveyed in more than one kind of guidance message. That's why it might be helpful to think of these kinds of message as being on a continuum.\r\n\r\nThe importance of the message and desired tone will ultimately determine whether we think of a message as a suggestion, a piece of information, or a warning. That will also help determine the best the type of delivery system for the message.\r\n\r\n![Guidance spectrum](/images/communications/messages/guidance-spectrum.png)\r\n\r\n<Grid>\r\n\r\n<GridCol col=\"span-4\">\r\n\r\n#### Suggestion\r\n\r\nA suggestion conveys a best practice, ideal workflow or other supplemental information. Suggestions offer specific tips that could make actions easier for many users, but may not apply to all users, and are not strictly necessary to complete the actions at hand.\r\n\r\n##### Delivery systems\r\n\r\n- [Well](#well)\r\n- [Uncontained text](#uncontained-text)\r\n\r\n</GridCol>\r\n\r\n<GridCol col=\"span-4\">\r\n\r\n#### Information\r\n\r\nInformation guidance gives the user additional information or context that they might find useful. Unlike a suggestion, which mentions best practices or ideal workflows, information takes a neutral stance and does not necessarily advocate for a specific course of action.\r\n\r\n##### Delivery systems\r\n\r\n- [Well](#well)\r\n- [Tooltip](#tooltip)\r\n- [Popover](#popover)\r\n- [Uncontained text](#uncontained-text)\r\n\r\n</GridCol>\r\n\r\n<GridCol col=\"span-4\">\r\n\r\n#### Warning\r\n\r\nWarning guidance informs the user of the potentially undesirable outcome of a future action. Unlike warning alerts&mdash;which interrupt the user's workflow and require additional action before proceeding&mdash;the user does not have to acknowledge or otherwise interact with warning guidance. The severity of the potential harm will often determine whether warning guidance or a warning alert is appropriate.\r\n\r\n##### Delivery systems\r\n\r\n- [Well](#well)\r\n\r\n</GridCol>\r\n\r\n</Grid>\r\n\r\n### Alerts\r\n\r\n<Grid>\r\n\r\n<GridCol col=\"span-4\">\r\n\r\nAlerts inform the user about the outcome of an action—either an action taken by the user or an action that's the result of a system process. Unlike guidance, alerts may interrupt a user's workflow and require additional action to be taken before allowing the user to proceed. Often, alerts inform the user of the outcome of a validation check.\r\n\r\n</GridCol>\r\n\r\n<GridCol col=\"span-8\">\r\n\r\n![Alerts infographic](/images/communications/messages/alerts-infographic.png)\r\n\r\n</GridCol>\r\n\r\n<GridCol col=\"span-3\">\r\n\r\n#### Information alert\r\n\r\nInformation alerts tell the user that something has happened as the result of an action, but not necessarily as the result of an action that the user has taken.\r\n\r\n##### Delivery systems\r\n\r\n[Toast](#toast)  \r\n[Dialog](#dialog)\r\n\r\n</GridCol>\r\n\r\n<GridCol col=\"span-3\">\r\n\r\n#### Success alert\r\n\r\nA success alert tells the user that an attempted action has succeeded.\r\n\r\n##### Delivery systems\r\n\r\n[Toast](#toast)  \r\n[Uncontained text](#uncontained-text)\r\n\r\n</GridCol>\r\n\r\n<GridCol col=\"span-3\">\r\n\r\n#### Warning alert\r\n\r\nA warning alert tells the user about a risk of irreversible destruction to data. Warning alerts are more emphatic than warning guidance messages are and require user action.\r\n\r\n##### Delivery systems\r\n\r\n[Dialog](#dialog)\r\n\r\n</GridCol>\r\n\r\n<GridCol col=\"span-3\">\r\n\r\n#### Fail alert\r\n\r\nA fail alert tells the user that an attempted action or product feature has failed.\r\n\r\n##### Delivery systems\r\n\r\n[Toast](#toast)  \r\n[Well](#well)  \r\n[Uncontained text](#uncontained-text)\r\n\r\n</GridCol>\r\n\r\n</Grid>\r\n","component":"","subComponent":"","zuiLayoutLargerWidth":null}},"context":{}}